var recruitData=[
    // {
    //     id:1,
    //     html:"" +
    //     "年薪：面议&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;人数：1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;有效期：长期<br>\n" +
    //     "职业要求：<p>\n" +
    //     "\t负责公司驻非洲业务的日常账务事项公司资金运作管理、日常财务管理与分析、资本运作等。\n" +
    //     "</p>\n" +
    //     "<p>\n" +
    //     "\t岗位职责：<br>\n" +
    //     "1、编制公司的总帐和明细帐，及时准确地记录公司业务往来帐；<br>\n" +
    //     "2、编制财务报表、统计报表和分析表；<br>\n" +
    //     "3、进行帐务处理，成本核算，固定资产的管理；<br>\n" +
    //     "4、审核和控制各项费用的支出，进行预算控制和日常资金管理；\n" +
    //     "</p>\n" +
    //     "<p>\n" +
    //     "\t任职资格：<br>\n" +
    //     "1、财务、会计、审计、金融专业学历，持有会计证；<br>\n" +
    //     "2、熟练操作办公软件和财务软件；<br>\n" +
    //     "3、熟悉会计报表的处理，会计法和税法；<br>\n" +
    //     "4、良好的职业操守和团队合作精神，较强的沟通、理解和分析能力；<br>\n" +
    //     "5、有一定的英语能力，会法语优先录用；<br>\n" +
    //     "6、此岗位驻非洲。\n" +
    //     "</p>\n" +
    //     "<p>\n" +
    //     "\t薪资福利：<br>\n" +
    //     "1、月薪酬：1OK；<br>\n" +
    //     "2、包住食宿；<br>\n" +
    //     "3、工作满一年有一个月带薪假；<br>\n" +
    //     "4、报销来回飞机票。\n" +
    //     "</p> "
    // },
    // {
    //     id:2,
    //     html:"年薪：面议&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;人数：1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;有效期：长期<br />\n" +
    //     "职业要求：<p>\n" +
    //     "\t岗位职责：<br />\n" +
    //     "1、负责日常收支的管理和核对；<br />\n" +
    //     "2、办公室基本账务的核对；<br />\n" +
    //     "3、负责收集和审核原始凭证，保证报销手续及原始单据的合法性、准确性；<br />\n" +
    //     "4、负责登记现金、银行存款日记账并准确录入系统；<br />\n" +
    //     "5、负责记账凭证的编号、装订；保存、归档财务相关资料；<br />\n" +
    //     "6、负责开具各项票据；<br />\n" +
    //     "7、配合财务室进行财务管理统计汇总。\n" +
    //     "</p>\n" +
    //     "<p>\n" +
    //     "\t任职资格：<br />\n" +
    //     "1、具有1年以上出纳工作经验；<br />\n" +
    //     "2、熟悉操作财务软件、Excel、Word等办公软件；<br />\n" +
    //     "3、记账要求字迹清晰、准确、及时，账目日清月结，报表编制准确、及时；<br />\n" +
    //     "4、工作认真，态度端正；<br />\n" +
    //     "5、了解国家财经政策和会计、税务法规，熟悉银行结算业务；<br />\n" +
    //     "6、家住莘庄及嘉定优先录入；<br />\n" +
    //     "7、上班地址：上海嘉定谢春路999号（提供莘庄至公司班车福利）\n" +
    //     "</p>    \n"
    // },
]


var byId = new Map();
recruitData.forEach(item => byId.set(item.id, item));

function getRecruitById(id) {
    return byId.get(id);
}

module.exports.getRecruitById=getRecruitById;